{
  "code": 200,
    "status": "OK",
  "introduction": {
    "name": "Introduction",
    "examples": "quran",
    "description": "ذُكر في القرآن باسمه صراحة، وبحسب ابن كثير فإنه هو الملك الموكل بالمطر والنبات."
  },
  "data": [
    {
      "id": 1,
      "name": "جبريل",
     "routerLink": "/",
      "description": "الملك جبريل ذكر أكثر من مرة في القرآن باسمه صراحة أو باسم الروح، وهو الملك المتكفل بالوحي، وله مكانة رفيعة عند الله حسب اعتقاد المسلمين، فقد أرسله الله لأنبيائه ورسله ليبلغهم الوحي، ولا تقتصر مهمته على تبليغ الوحي، فقد كان ينزل في ليالي رمضان ليدارس النبي محمد القرآن. وقد أمّه صلاةً ليعلمه كيف يؤدي الصلاة، ورقاه، وحارب معه في غزوة بدر وغزوة الخندق."
    },
    {
      "id": 2,
      "name": "ميكائيل",
     "routerLink": "/",
      "description": "ذُكر في القرآن باسمه صراحة، وبحسب ابن كثير فإنه هو الملك الموكل بالمطر والنبات."
    },
    {
      "id": 3,
      "name": "إسرافيل",
     "routerLink": "/",
      "description": "وهو الملك الذي ينفخ في الصور عند قرب القيامة بحسب ما ذكر في الحديث، وكان هؤلاء الثلاثة (جبريل وميكائيل وإسرافيل) يستفتح بهم النبي محمد صلاته في الليل ويذكرهم في دعائه."
    },
    {
      "id": 4,
      "name": "مالك",
     "routerLink": "/",
      "description": "خازن النار وجاء اسمه صريحاً في القرآن  وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ قَالَ إِنَّكُمْ مَاكِثُونَ"
    },
    {
      "id": 5,
      "name": "رضوان",
     "routerLink": "/",
      "description": "خازن الجنة وجاء اسمه صريحاً في بعض الأحاديث."
    },
    {
      "id": 6,
      "name": "منكر ونكير",
     "routerLink": "/",
      "description": " هما ملكان موكلان بسؤال الإنسان عند موته في قبره عن دينه وإلهه ونبيه، وقد ذكر اسمهيما صريحاً في بعض الأحاديث."
    },
    {
      "id": 7,
      "name": "هاروت وماروت",
     "routerLink": "/",
      "description": "ملكان ذُكر اسمهما في القرآن، وأنهما نزلا بأرض بابل."
    },
    {
      "id": 8,
      "name": "ملك الموت",
     "routerLink": "/",
      "description": "خهو الملك الموكل بنزع أرواح العباد، لم يذكر اسمه صراحة بالقرآن والسنة، وجاء فيهما ذكر اسم «ملك الموت». "
    },
    {
      "id": 9,
      "name": "حملة العرش",
     "routerLink": "/",
      "description": "هم ملائكة موكلون بحمل العرش وعددهم ثمانية، وجائ ذكرهم في القرآن. "
    },
    {
      "id": 10,
      "name": "الرعد",
     "routerLink": "/",
      "description": "هو ملك موكل بالسحاب، معه مخاريق من نار يسوقها حيث شاء الله كما ذُكر في بعض الأحاديث."
    },
    {
      "id": 11,
      "name": "ملك الجبال",
     "routerLink": "/",
      "description": "هو ملك موكل بالجبال، وذُكرت له قصة مع النبي محمد في بعض الأحاديث"
    },
    {
      "id": 12,
      "name": "الزبانية",
     "routerLink": "/",
      "description": "هم خزنة جهنم، وهم من الملائكة. جاء ذكرهم في القرآن في سورة العلق في سورة العلق "
    }
  ]
}