{
  "code": 200,
    "status": "OK",
  "introduction": {
    "name": "Introduction",
    "examples": "quran",
    "description": "ذُكر في القرآن باسمه صراحة، وبحسب ابن كثير فإنه هو الملك الموكل بالمطر والنبات."
  },
  "data": [
    {
      "name": "آدم",
      "revelation": "التوراة",
      "lifespan": "غير معروف",
      "routerLink": "/",
      "description": "أول إنسان خلقه الله (الله) وفقًا للإيمان الإسلامي، وأبو الجنس البشري. يعتبر آدم أول نبي في الإسلام."
      },
      {
      "name": "إدريس",
      "revelation": "الصحف",
      "lifespan": "غير معروف",
      "routerLink": "/",
      "description": "نبي ذكر بإيجاز في القرآن يعتقد بعض المسلمين أنه تم أخذه حيًا إلى السماء."
      },
      {
      "name": "نوح",
      "revelation": "الصحف",
      "lifespan": "غير معروف",
      "routerLink": "/",
      "description": "النبي الذي أرسله الله ليحذر شعبه من الطوفان القادم ويدعوهم إلى التوحيد. يعتبر نوح أحد أهم الأنبياء في الإسلام وباني السفينة."
      },
      {
        "name": "هود",
        "revelation": "الصحف السماوية",
        "lifespan": "غير معروف",
        "routerLink": "/",
        "description": "أُرسِل إلى شعب مدينة عاد ليدعوهم إلى التوحيد، ولكنهم رفضوا رسالته ودمروا بعد ذلك بريح شديدة أرسلها الله."
        },
        {
        "name": "صالح",
        "revelation": "الصحف السماوية",
        "lifespan": "غير معروف",
        "routerLink": "/",
        "description": "أُرسِل إلى شعب مدينة ثمود ليدعوهم إلى التوحيد، ولكنهم رفضوا رسالته ودمروا بعد ذلك بزلزال."
        },
        {
          "name": "إبراهيم",
          "revelation": "الصحف",
          "lifespan": "غير معروف",
          "routerLink": "/",
          "description": "يعرف أيضًا باسم إبراهام، ويعتبر أبا الأنبياء وسلف النبي محمد. تم اختبار إبراهيم من قبل الله بطرق عديدة، بما في ذلك الأمر بذبح ابنه."
          },
          {
          "name": "لوط",
          "revelation": "الصحف",
          "lifespan": "غير معروف",
          "routerLink": "/",
          "description": "أرسل إلى قوم سدوم وعمورة ليدعوهم إلى التوحيد وإلى التوقف عن سلوكهم اللاإخلاقي، ولكنهم رفضوا رسالته ودمرهم الله بالكبريت والنار."
          },
          {
          "name": "إسماعيل",
          "revelation": "الصحف",
          "lifespan": "غير معروف",
          "routerLink": "/",
          "description": "ابن إبراهيم وهاجر، ويعتبر نبيًا في الإسلام وأب العرب."
          },
          {
          "name": "إسحاق",
          "revelation": "الصحف",
          "lifespan": "غير معروف",
          "routerLink": "/",
          "description": "ابن إبراهيم وسارة، ويعتبر نبيًا في الإسلام وأب الإسرائيليين."
          },
          {
            "name": "يعقوب",
            "revelation": "الصحف",
            "lifespan": "غير معروف",
            "routerLink": "/",
            "description": "ابن إسحاق، يُعتبر يعقوب نبيًا في الإسلام وأبًا لاثني عشر سبطًا إسرائيليًا."
            },
            {
            "name": "يوسف",
            "revelation": "الصحف",
            "lifespan": "غير معروف",
            "routerLink": "/",
            "description": "ابن يعقوب، يُعتبر يوسف نبيًا في الإسلام وتم بيعه كعبد من قبل إخوته الحسودين. أصبح فيما بعد مستشارًا موثوقًا به لفرعون مصر."
            },
            {
            "name": "شعيب",
            "revelation": "الصحف",
            "lifespan": "غير معروف",
            "routerLink": "/",
            "description": "أُرسل إلى شعب مدين ليدعوهم إلى التوحيد وترك سلوكهم الظالم، لكنهم رفضوا رسالته وتم تدميرهم بواسطة صاعقة من الله."
            },
            {
              "name": "أيوب",
              "revelation": "الصُّحُف",
              "lifespan": "غير معروف",
              "routerLink": "/",
              "description": "يُعتَبرُ أيوب، المعروفُ أيضًا باسم جوب في الكتاب المقدس، نبيًّا في الإسلام. وهو معروفٌ بإيمانِهِ الراسخ بالله رغمَ تعرضِهِ للمحنِ والآلام الشديدة."
              },
              {
              "name": "ذو الكفل",
              "revelation": "الصُّحُف",
              "lifespan": "غير معروف",
              "routerLink": "/",
              "description": "ذو الكفل هو نبي ذُكِر في القرآن، ولا يوجد تعريف واضح لهويتهِ وقصتهِ في التقاليد الإسلامية. يعتقد بعض العلماء أنهُ يشير إلى نبي حزقيال في الكتاب المقدس."
              },
              {
              "name": "موسى",
              "revelation": "التوراة",
              "lifespan": "حوالي 1526 ق.م - حوالي 1406 ق.م",
              "routerLink": "/",
              "description": "موسى، المعروفُ أيضًا باسم موسى في الكتاب المقدس، هو واحدٌ من أهم الأنبياء في الإسلام. يُعرفُ بقيادتِهِ للإسرائيليين من خلالِ فترةِ العبودية في مصر، واستلامِهِ للوصايا العشر من الله، ولأعمالِهِ المعجزات وتفاعُلِهِ مع فرعون."
              },
              {
                "name": "هارون",
                "revelation": "التوراة",
                "lifespan": "غير معروف",
                "routerLink": "/",
                "description": "هارون، المعروف أيضًا باسم هارون في الكتاب المقدس، هو الأخ الأكبر لموسى ويعتبر نبيًا في الإسلام. وهو معروف بدوره كداعم لموسى خلال مهمتهما لتحرير بني إسرائيل من العبودية في مصر."
                },
                {
                "name": "داود",
                "routerLink": "david",
                "revelation": "الزبور",
                "lifespan": "نحو 1040 قبل الميلاد - 970 قبل الميلاد",
                "routerLink": "/",
                "description": "داود، المعروف أيضًا باسم داود في الكتاب المقدس، هو نبي وملك يعتبر في الإسلام. وهو معروف بشجاعته وانتصاره على العملاق جالوت، وكذلك بموهبته في الشعر والموسيقى."
                },
                {
                "name": "سليمان",
                "revelation": "الزبور",
                "lifespan": "غير معروف",
                "routerLink": "/",
                "description": "سليمان، المعروف أيضًا باسم سليمان في الكتاب المقدس، هو نبي وملك يعتبر في الإسلام. وهو معروف بحكمته، وبناء الهيكل الأول في القدس، وسيطرته على الجن والكائنات الأخرى."
                },
                {
                "name": "إلياس",
                "revelation": "الصحف",
                "lifespan": "غير معروف",
                "routerLink": "/",
                "description": "إلياس، المعروف أيضًا باسم إيليا في الكتاب المقدس، هو نبي يعتبر في الإسلام. وهو معروف بإيمانه الراسخ بالله وعديد من المعجزات، بما في ذلك إحياء الأرض الممطرة بالمطر في الزمن الجاف."
                },
                {
                  "name": "اليسع",
                  "revelation": "الصحف",
                  "lifespan": "غير معروف",
                  "routerLink": "/",
                  "description": "يعتبر اليسع، المعروف أيضًا باسم اليشع في الكتاب المقدس، نبيًا في الإسلام. وهو معروف بأعماله المعجزية، بما في ذلك إحياء طفل ميت وشفاء مصاب بالجذام."
                  },
                  {
                  "name": "يحيى",
                  "revelation": "الإنجيل",
                  "lifespan": "غير معروف",
                  "routerLink": "/",
                  "description": "يُعتبر يحيى (يوحنا المعمدان) نبيًا ويُكرم في الإسلام لدوره كسلف للنبي عيسى (يسوع). وكان معروفًا بزهده ودعوته إلى التوبة والأعمال الصالحة. ويذكر في القرآن كأحد الرسل الصالحين والأنبياء الكرام."
                  },
                  {
                  "name": "عيسى",
                  "revelation": "الإنجيل",
                  "lifespan": "حوالي 33 سنة",
                  "routerLink": "/",
                  "description": "يعتبر عيسى (يسوع) نبيًا ورسول الله في الإسلام، ويُكرَم لولادته المعجزية، وتعاليمه، ودوره كسلف للنبي محمد. ويعتقد أيضًا أنه قام بأعمال كثيرة معجزية، بما في ذلك شفاء المرضى وإحياء الموتى. ويعتقد المسلمون أن عيسى لم يُصلب، بل رُفع إلى السماء من قبل الله، وسيعود إلى الأرض قبل نهاية الزمان."
                  },
                  {
                  "name": "محمد",
                  "revelation": "القرآن",
                  "lifespan": "570-632 م",
                  "routerLink": "/",
                  "description": "يعتبر محمد آخر الأنبياء والرسل من الله في الإسلام، ويُكرم كزعيم ديني وسياسي وعسكري. تلقى محمد الوحي من الله عبر الملاك جبريل، وتم تسجيله في القرآن.  يشتهر محمد بشخصيته وتعاليمه ، بما في ذلك أركان الإسلام الخمسة ، التي تشكل أساس الممارسة الإسلامية. يعتبر نموذجًا للسلوك الصالح ، ولا تزال حياته وتعاليمه مصدر إلهام للمسلمين في جميع أنحاء العالم."
    }
  ]
}