{
  "kod": 200,
    "status": "OK",
  "introduction": {
    "name": "Introduction",
    "examples": "quran",
    "description": "some description"
  },
  "data": [
    {
      "name": "Dagens tecken",
      "routerLink": "signs",
      "description": "Detta är de händelser och fenomen som sägs inträffa före Domedagen, såsom Antikrists (Dajjal) framträdande, Imam Mahdis ankomst och uppkomsten av Gog och Magog."
    },
    {
      "name": "Uppståndelse",
      "routerLink": "resurrection",
      "description": "Detta syftar på tron att alla människor kommer att återuppstå på Domedagen och deras kroppar kommer att återupplivas."
    },
    {
      "name": "Ansvarsskyldighet",
      "routerLink": "accountability",
      "description": "Detta hänvisar till tron att på Domedagen kommer varje person att hållas ansvarig för sina handlingar i livet och kommer att belönas eller straffas i enlighet med detta."
    },
    {
      "name": "Helvete",
      "routerLink": "hell",
      "description": "Detta är en plats för straff för dem som var olydiga Allah och levde ett syndigt liv. Helvetet beskrivs som en plats för intensivt lidande och plåga, där invånarna kommer att utsättas för olika former av straff. Dessa straff tror man att inkludera att bränna i eld, dricka kokande vatten och att dras över glödande kol. Enligt islamisk tro är straffen i helvetet eviga, och det finns ingen flykt från det när en person väl skickas dit."
    },
    {
      "name": "Förbön",
      "routerLink": "intercession",
      "description": "Detta syftar på tron att vissa individer, såsom profeter och rättfärdiga människor, kommer att ges möjligheten att gå i förbön på andras vägnar på domedagen."
    },
    {
      "name": "Paradise",
      "routerLink": "paradise",
      "description": "Detta är en plats för belöning för dem som levde ett rättfärdigt liv och följde Allahs befallningar. Paradiset beskrivs som en plats av enorm skönhet, där invånarna kommer att beviljas olika välsignelser och nöjen. Dessa inkluderar trädgårdar med strömmande floder, vackra följeslagare och utsökt mat och dryck. Enligt islamisk tro är belöningarna i Paradiset eviga, och det finns inget slut på den lycka och välsignelser som invånarna kommer att uppleva."
    }
  ]
}