{
  "code": 200,
  "status": "OK",
  "introduction": {
    "name": "هاروت وماروت",
    "example": "إن هاروت وماروت كانا ملائكةً يدرسان السحر في مدينة بابل",
    "who": "هاروت وماروت هما اسمان لملائكة ذكرا في القرآن الكريم.",
    "role": "هاروت وماروت هما اسمان لملائكة ذكرا في القرآن الكريم.",
    "look": "هاروت وماروت هما اسمان لملائكة ذكرا في القرآن الكريم.",
    "description": "هاروت وماروت هما اسمان لملائكة ذكرا في القرآن الكريم.",
    "quran": "وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ ۖ وَمَا كَفَرَ سُلَيْمَانُ وَلَٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنْزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ ۚ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ ۚ وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّهِ ۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ ۚ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ"
},
  "data": [
    {
      "id": 1,
      "name": "Jibril (Gabriel)",
      "routerLink": "Jibril",
      "description": "The angel Jibril (Gabriel) was mentioned several times in the Quran by name explicitly or by the name of the spirit. He is the angel responsible for revelation and has a high status in the eyes of Allah, according to the beliefs of Muslims. Allah sent him to his prophets and messengers to deliver revelation, and his mission was not limited to delivering revelation alone. He used to come down in the nights of Ramadan to study the Quran with the Prophet Muhammad. He also taught him how to perform prayer, and fought with him in the battles of Badr and the Trench."
    },
    {
      "id": 2,
      "name": "Mikail (Michael)",
      "routerLink": "Mikail",
      "description": "He was mentioned in the Quran by name explicitly, and according to Ibn Kathir, he is the angel responsible for rain and plants."
    },
    {
      "id": 3,
      "name": "Israfil (Raphael)",
      "routerLink": "Israfil",
      "description": "He is the angel who will blow the trumpet when the Day of Judgment approaches, according to the Hadith. These three angels (Jibril, Mikail, and Israfil) were sought by the Prophet Muhammad in his night prayer and remembered in his supplication."
    },
    {
      "id": 4,
      "name": "Malik",
      "routerLink": "Malik",
      "description": "The guardian of Hellfire, and his name is mentioned explicitly in the Quran, 'And they will call, 'O Malik, let your Lord put an end to us!' He will say, 'Indeed, you will remain.''"
    },
    {
      "id": 5,
      "name": "Ridwan",
      "routerLink": "Ridwan",
      "description": "The guardian of Paradise, and his name is mentioned explicitly in some Hadiths."
    },
    {
      "id": 6,
      "name": "Munkar and Nakir",
      "routerLink": "MunkarAndNakir",
      "description": "They are two angels responsible for questioning a person in his grave about his religion, his God, and his prophet. Their names were mentioned explicitly in some Hadiths."
    },
    {
      "id": 7,
      "name": "Harut and Marut",
      "routerLink": "HarutAndMarut",
      "description": "Two angels whose names were mentioned in the Quran, and they descended to the land of Babylon."
    },
    {
      "id": 8,
      "name": "king of Death",
      "routerLink": "kingOfDeath",
      "description": "The angel who is responsible for taking the souls of humans. His name is not mentioned explicitly in the Quran and Hadith, but he is referred to as 'Angel of Death'."
    },
    {
      "id": 9,
      "name": "The Bearers of the Throne",
      "routerLink": "Bearers",
      "description": "هم ملائكة موكلون بحمل العرش وعددهم ثمانية، وجائ ذكرهم في القرآن. "
    },
    {
      "id": 10,
      "name": "the Thunder",
      "routerLink": "Thunder",
      "description": "هو ملك موكل بالسحاب، معه مخاريق من نار يسوقها حيث شاء الله كما ذُكر في بعض الأحاديث."
    },
    {
      "id": 11,
      "name": "King of the Mountains",
      "routerLink": "Mountains",
      "description": "هو ملك موكل بالجبال، وذُكرت له قصة مع النبي محمد في بعض الأحاديث"
    },
    {
      "id": 12,
      "name": "Zabaniya",
      "routerLink": "Zabaniya",
      "description": "هم خزنة جهنم، وهم من الملائكة. جاء ذكرهم في القرآن في سورة العلق في سورة العلق "
    }
  ]
}